
using Tyuiu.NovikovAA.Sprint1.Task1.V16.Lib;

// ЗАДАНИЕ //
// Написать программу,
// которая запрашивает
// у пользователя исходные данные, вычисляет результат по формуле x*5*y+2*a и печатает его на экране.//
namespace Tyuiu.NovikovAA.Sprint1.Task1.V16
{
    internal class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello, World!");
        }
    }
}
