
using Tyuiu.NovikovAA.Sprint1.Task3.V14.Lib;

//Написать программу, которая позволяет определить число,
//полученное выписыванием в обратном порядке цифр заданного
//трехзначного числа. Ответ округлите до 3 знаков после запятой.


namespace Tyuiu.NovikovAA.Sprint1.Task3.V14_
{
    internal class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Введите число:");
            double number = Convert.ToDouble(Console.ReadLine());
            Console.WriteLine($"Число, полученное выписыванием в обратном порядке цифр: ");

        }
    }
}
